<style scoped lang='less'>
.hello {}
article {
    padding: 16px;
    h2 {
        font-size: 18px;
        margin: 0 0 16px;
    }
    p {
        font-size: 16px;
        margin: 0 0 16px;
        line-height: 1.6;
    }
}
</style>

<template>
<div class="hello">
  <!-- header -->
  <header>
    <div class="header-left">
      <router-link to="/tabs/home"><img src="../../assets/icon_back.svg" height="24" width="24" style="display:block;"></router-link>
    </div>
    <div class="title">{{title}}</div>
  </header>
  <!-- / -->
  <div class="content-box">
    <article>
      <p>尼尔森（Jakob Nielsen）是一位人机交互学博士，于 1995 年 1 月 1 日发表了「十大可用性原则」。1995 年以来，他通过自己的 Alertbox 邮件列表以及 useit.com 网站，向成千上万的 Web 设计师传授 Web 易用性方面的知识。</p>
      <h2>原则一：状态可见原则</h2>
      <p>用户在网页上的任何操作，不论是单击、滚动还是按下键盘，页面应即时给出反馈。「即时」是指，页面响应时间小于用户能忍受的等待时间。</p>
      <p>案例：站酷的关注按钮，当用户点击右上角的用户关注时，按钮由黄色变为黑色，同时里面的 icon 变为对勾，这种状态可见性可以清晰的让用户感受到页面即时给出的反馈。</p>
      <h2>原则二：环境贴切原则</h2>
      <p>网页的一切表现和表述，应该尽可能贴近用户所在的环境（年龄、学历、文化、时代背景），而不要使用第二世界的语言。</p>
      <p>案例：微信的红包设计，很符合中国人的传统文化习俗，在国人的现实生活中，发红包都是拿纸质的红包袋发红包，所以在微信的红包设计中，也保留了现实生后中红包的元素，让用户感觉更加真实。</p>
      <h2>原则三：撤销重做原则</h2>
      <p>为了避免用户的误用和误击，网页应提供撤销和重做的功能。</p>
      <p>案例：其实平时在我们使用的很多软件都会有撤销重做按钮，例如 ps、ai 等太多了，在此拿出 uc 浏览器做个案例，当用户不小心点击错误误进入其它页面，直接向左滑就可以返回到上一页，给予用户撤销返回的功能，比较友好的体验。</p>
      <h2>原则四：一致性原则</h2>
      <p>同一用语、功能、操作保持一致。同样的语言，同样的情景，操作应该出现同样的结果。</p>
      <p>案例：一致性原则是比较重要也是比较基础的原则，其实在平时的设计中，见到最多的就是 ui 设计里的一致性原则，例如软件整体的风格是扁平化风格，如果这个时候突然出来一个拟物化风格的图标就会让用户感到很困惑，和整体格格不入。</p>
      <h2>原则五：防错原则</h2>
      <p>通过页面的设计、重组或特别安排，防止用户出错。比出现错误信息提示更好的是更用心的设计防止这类问题发生。</p>
      <p>案例：例如在用户进行一个不可逆操作的时候，系统会跳出二次确认窗口去提醒用户，除此之外，例如用户在注册账号的时候，通过手机号码注册，当用户输入手机号码少于或者多于 11 位时，输入框旁边会自动出现一个红色星号提示去提醒用户。</p>
      <h2>原则六：易取原则</h2>
      <p>尽量减少用户对操作目标的记忆负荷，动作和选项都应该是可见的，即把需要记忆的内容摆上台面。</p>
      <p>案例：最显著的案例就像苹果手机一样，当在接收注册短信验证码的时候，短信会出现在上面，用户不用去记忆验证码，可以直接看着验证码输入。</p>
      <h2>原则七：灵活高效原则</h2>
      <p>中级用户的数量远高于初级和高级用户数。为大多数用户设计，不要低估，也不可轻视，保持灵活高效。</p>
      <p>案例：每个产品针对的用户不可能是全部所有的用户，都是有一定的设计定位的，针对主要的用户去设计，而不能仅仅为了一小部分用户进行极端设计，满足大部分用户的需求是最重要的原则。</p>
      <h2>原则八：易扫原则</h2>
      <p>互联网用户浏览网页的动作不是读，不是看，而是扫。易扫，意味着突出重点，弱化和剔除无关信息。</p>
      <p>案例：这个原则是作者当时针对网页设计提出的原则，其实，在 app 里设计也是一样的道理，软件设计要剔除和弱化与主流程无关的信息，去掉冗长的文字，能用图表信息展示的尽量使用图表，尽量减少用户在阅读过程中的压力。</p>
      <h2>原则九：容错原则</h2>
      <p>错误信息应该用语言表达（不要用代码），较准确地反应问题所在，并且提出一个建设性的解决方案。</p>
      <p>案例：当网页出现问题的时候，chrome 浏览器会明确的告诉用户，是什么原因出错以及出错后的几种解决办法进行解决。</p>
      <h2>原则十：人性化帮助原则</h2>
      <p>如果系统不使用文档是最好的，但是有必要提供帮助和文档。任何信息应容易去搜索，专注于用户的任务，列出具体的步骤来进行。帮助性提示最好的方式是：<strong>1、无需提示；2、一次性提示；3、常驻提示；4；帮助文档。</strong></p>
      <p>案例：这个原则就比较好理解了，如果你的产品设计的人性化，用户不需要再去看你的帮助提示直接就可以使用，这样对于用户而言是最好的方式；即使需要看提示，也只需要简单的根据产品提示就可以直接上手产品的使用，比如下图的引导页和进入页后的简单提示。</p>
    </article>
  </div>
</div>
</template>

<script>
import {} from 'vux'
export default {
  name: 'home',
  components: {},
  data() {
    return {
      title: '尼尔森的十大可用性原则',
    }
  },
  methods: {}
}
</script>
